app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT * FROM `auctions`