app/controllers/characters_controller.rb

  def find_character
    @character = current_user.characters.find params[:id]
---
SELECT * FROM `characters` WHERE (`characters`.`id` = 1 AND (`characters`.user_id = 1))