app/controllers/formulas_controller.rb

  def index
    @formulas = Formula.all
---
SELECT * FROM `formulas`

  def find_formula
    @formula = Formula.find params[:id]
---
SELECT * FROM `formulas` WHERE (`formulas`.`id` = 1)