app/controllers/game_controller.rb

SELECT * FROM `scenarios` LIMIT 1
---
  def index
    @character = current_character
    @character.scenario = Scenario.first unless @character.scenario