app/controllers/item_templates_controller.rb

SELECT * FROM `item_templates`
---
  def index
    @item_templates = ItemTemplate.all

SELECT * FROM `item_templates` WHERE (`item_templates`.`id` = 3)
---
  def show
    @item_template = ItemTemplate.find(params[:id])

SELECT * FROM `item_templates` WHERE (`item_templates`.`id` = 2)
---
  def edit
    @item_template = ItemTemplate.find(params[:id])

INSERT INTO `item_templates` (`name`, `price`, `created_at`, `max_stack`, `updated_at`, `slot`, `icon_file_name`, `icon_content_type`, `icon_file_size`, `extra`, `icon_updated_at`) VALUES('Map', 100, '2010-05-12 01:41:07', NULL, '2010-05-12 01:41:07', '', NULL, NULL, NULL, '--- !map:HashWithIndifferentAccess {}\n\n', NULL)
---
  def create
    @item_template = ItemTemplate.new(params[:item_template])

    respond_to do |format|
      if @item_template.save

SELECT * FROM `item_templates` WHERE (`item_templates`.`id` = 2)
UPDATE `item_templates` SET `updated_at` = '2010-05-18 07:43:22', `extra` = '--- !map:HashWithIndifferentAccess \nmax_level: !str \n str: \"30\"\n \"@_rails_html_safe\": false\nref_level: !str \n str: \"10\"\n \"@_rails_html_safe\": false\nrequirements: !map:HashWithIndifferentAccess \n lvl: !str \n str: \"\"\n \"@_rails_html_safe\": false\n agi: !str \n str: \"\"\n \"@_rails_html_safe\": false\n str: !str \n str: \"\"\n \"@_rails_html_safe\": false\n spr: !str \n str: \"\"\n \"@_rails_html_safe\": false\nmax_dmg: !str \n str: \"8\"\n \"@_rails_html_safe\": false\nmin_dmg: !str \n str: \"5\"\n \"@_rails_html_safe\": false\n' WHERE `id` = 2
---
  def update
    @item_template = ItemTemplate.find(params[:id])

    respond_to do |format|
      if @item_template.update_attributes(params[:item_template])