app/controllers/items_controller.rb

  def find_character
    @character = Character.find params[:character_id]
---
SELECT * FROM `characters` WHERE (`characters`.`id` = 1) LIMIT 1

  def find_item
    @item = @character.items.find params[:id]
---
SELECT * FROM `items` WHERE (`items`.`id` = 24 AND (`items`.owner_id = 1))