app/controllers/merchandises_controller.rb

  def index
    @merchandises = @shop.merchandises.all
---
SELECT * FROM `merchandises` WHERE (`merchandises`.shop_id = 1)

  def buy
    if current_character.money < @merchandise.price
      flash[:error] = 'You do not have enough money'
      return redirect_to :back
    end
    unless @merchandise.has_stock?
      flash[:error] = 'That kind of goods has been sold out'
      return redirect_to :back
    end

    Shop.transaction do
      @merchandise.lock!
      current_character.lock!
      current_character.money -= @merchandise.price
      current_character.items << @merchandise.item_template.generate
      @merchandise.decr_stock
      current_character.save!
---
INSERT INTO `items` (`created_at`, `template_id`, `quantity`, `updated_at`, `in_slot`, `owner_id`, `extra`) VALUES('2010-05-12 11:01:28', 2, 1, '2010-05-12 11:01:28', NULL, 1, '--- {}\n\n')
UPDATE `characters` SET `updated_at` = '2010-05-12 11:01:28', `money` = 99021, `abilities` = '--- \n- Attack\n- Healing\n' WHERE `id` = 1

  def find_shop
    @shop = Shop.find params[:shop_id] if params[:shop_id]
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 1)

  def find_merchandise
    @merchandise = @shop.merchandises.find params[:id]
---
SELECT * FROM `merchandises` WHERE (`merchandises`.`id` = 8 AND (`merchandises`.shop_id = 1))