app/controllers/scenarios_controller.rb

SELECT * FROM `scenarios`
---
  def index
    @scenarios = {}
    @matrix = {}
    Scenario.all.each do |s|