app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT * FROM `shops`

  def find_shop
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 1)