app/controllers/users_controller.rb

  def show
    @user = User.find params[:id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1